pkahlert/EPE-MES/02_Software/01_c2000/C2000_LaunchPad/f2802x_examples/LED_Boost_CapTouch/LED_Boost_CapTouch_Main.c
//#############################################################################
//
//  File:   f2802x_examples/LED_Boost_CapTouch/LED_Boost_CapTouch_Main.c
//
//  Title:  Capacitive Touch Controlled LED Lighting Demo.
//
//  Group:          C2000
//  Target Device:  TMS320F2802x
//
//! \addtogroup example_list
//!  <h1>LED BoosterPack Capacitive Touch Demo</h1>
//!
//!   This example allows the user to control the LED Boosterpack's color by
//!   spinning their finger on the capacitive touch boosterpack when plugged into
//!   the LED boosterpack.
//!
//!   For this example to work S4 on the C2000 LaunchPad should be in the down
//!   position, while S1 on the LED Boosterpack should be in the up position.
//!
//!   This example uses the same control techniques used in the other LED
//!   BoosterPack examples, but uses the MSP430 present on the LED BoosterPack
//!   as a sensor hub.  The MSP430 interfaces with the Capacitive Touch
//!   BoosterPack directly and reports actions to the Piccolo device on the C2000
//!   LaunchPad via an asynchronous serial interface.
//!
//!   After loading and running this example, press the center section of the
//!   capacitive touch BoosterPack twice to turn on the LEDs.  Moving ones finger
//!   around the outer sections of the touchpad will change the LED color.
//!   Touching the center section again will turn off the LEDs.
//
//  (C) Copyright 2012, Texas Instruments, Inc.
//#############################################################################
// $TI Release: LaunchPad f2802x Support Library v100 $
// $Release Date: Wed Jul 25 10:45:39 CDT 2012 $
//#############################################################################

#include "DSP28x_Project.h"
#include "LED_Boost_CapTouch_Settings.h"
#include "f2802x_common/include/F2802x_EPwm_defines.h"

#include "DPlib.h"
#include "f2802x_common/include/IQmathLib.h"


//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// FUNCTION PROTOTYPES
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

// -------------------------------- FRAMEWORK --------------------------------------
void DeviceInit(void);
#ifdef FLASH        
void InitFlash();
#endif
void SCIA_Init();
void SerialHostComms();

// State Machine function prototypes
//------------------------------------
// Alpha states
void A0(void);    //state A0
void B0(void);    //state B0
void C0(void);    //state C0

// A branch states
void A1(void);    //state A1
void A2(void);    //state A2

// B branch states
void B1(void);    //state B1
void B2(void);    //state B2

// C branch states
void C1(void);    //state C1
void C2(void);    //state C2

// Variable declarations
void (*Alpha_State_Ptr)(void);   // Base States pointer
void (*A_Task_Ptr)(void);        // State pointer A branch
void (*B_Task_Ptr)(void);        // State pointer B branch
void (*C_Task_Ptr)(void);        // State pointer C branch


// ---------------------------------- USER -----------------------------------------

typedef struct
{
    _iq15 qHue;
    _iq15 qSaturation;
    _iq15 qValue;

}tHSV;

typedef struct
{
    _iq15 qRed;
    _iq15 qGreen;
    _iq15 qBlue;
}tRGB;

extern interrupt void SciISR(void);
void ADC_SOC_CNF(int ChSel[], int Trigsel[], int ACQPS[], int IntChSel, int mode);
void PWM_1ch_UpDwnCnt_CNF(int16 n, int16 period, int16 mode, int16 phase);
void PWM_DualUpDwnCnt_CNF(int16 n, int16 Period, int16 Mode, int16 Phase);
void HSVtoRGB(tHSV *myHSV, tRGB *myRGB);

//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// VARIABLE DECLARATIONS - GENERAL
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

// -------------------------------- FRAMEWORK --------------------------------------

int16    VTimer0[4]={0,0,0,0};         // Virtual Timers slaved off CPU Timer 0 (A events)
int16    VTimer1[4]={0,0,0,0};         // Virtual Timers slaved off CPU Timer 1 (B events)
int16    VTimer2[4]={0,0,0,0};         // Virtual Timers slaved off CPU Timer 2 (C events)
int16    SerialCommsTimer=0;
int16     CommsOKflg=0;

// ---------------------------------- USER -----------------------------------------
int16    Gui_LEDPrd=1000;
int16    temp_LEDDelay=0;


// C address variables for use with ASM module terminals
long    AdcNetBus[16]={0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};      // used as consecutive addresses for ADC_Rslts
long    VinNetBus=0;               // used as address for Vin

long    IrefNetBus1=0;             // used as address for Iref1
long    UoutNetBus1=0;             // used as address for Uout1
#pragma DATA_SECTION(CNTL_2P2Z_CoefStruct1, "CNTL_2P2Z_Coef");
struct CNTL_2P2Z_CoefStruct CNTL_2P2Z_CoefStruct1;

long    IrefNetBus2=0;             // used as address for Iref2
long    UoutNetBus2=0;             // used as address for Uout2
#pragma DATA_SECTION(CNTL_2P2Z_CoefStruct2, "CNTL_2P2Z_Coef");
struct CNTL_2P2Z_CoefStruct CNTL_2P2Z_CoefStruct2;

long    IrefNetBus3=0;             // used as address for Iref3
long    UoutNetBus3=0;             // used as address for Uout3
#pragma DATA_SECTION(CNTL_2P2Z_CoefStruct3, "CNTL_2P2Z_Coef");
struct CNTL_2P2Z_CoefStruct CNTL_2P2Z_CoefStruct3;


// ASM module terminal pointers
// Boost channel 1 terminal pointers
extern long    *ADCDRV_1ch_Rlt1;
extern long    *CNTL_2P2Z_Ref1, *CNTL_2P2Z_Fdbk1, *CNTL_2P2Z_Out1;
extern long    *CNTL_2P2Z_Coef1;
extern long    *PWMDRV_DualUpDwnCnt_Duty1A;

// Boost channel 2 terminal pointers
extern long    *ADCDRV_1ch_Rlt2;
extern long    *CNTL_2P2Z_Ref2, *CNTL_2P2Z_Fdbk2, *CNTL_2P2Z_Out2;
extern long    *CNTL_2P2Z_Coef2;
extern long    *PWMDRV_DualUpDwnCnt_Duty1B;

// Boost channel 3 terminal pointers
extern long    *ADCDRV_1ch_Rlt3;
extern long    *CNTL_2P2Z_Ref3, *CNTL_2P2Z_Fdbk3, *CNTL_2P2Z_Out3;
extern long    *CNTL_2P2Z_Coef3;
extern long    *PWMDRV_1ch_UpDwnCnt_Duty2;

// Voltage terminal pointers
extern long    *ADCDRV_1ch_Rlt9;
extern long    *ADCDRV_1ch_Rlt10;
extern long    *ADCDRV_1ch_Rlt11;
extern long    *ADCDRV_1ch_Rlt12;

// ADC configuration variables
int16    ChSel[16]={0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
int16    TrigSel[16]={0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
int16    ACQPS[16]={6,25,25,25,6,6,6,6,6,6,6,6,6,6,6,6};

//---------------------------------------------------------------------------
// Used to indirectly access all EPWM modules
volatile struct EPWM_REGS *ePWM[] = 
                  { &EPwm1Regs,         //intentional: (ePWM[0] not used)
                    &EPwm1Regs,
                    &EPwm2Regs,
                    &EPwm3Regs,
                    &EPwm4Regs
                  };

// Slew control
long    Iset1=0;                  // Control loop 1 target
long    Iset2=0;                  // Control loop 2 target
long    Iset3=0;                  // Control loop 3 target

long    Itarget1=0;               // Control loop 1 target adjusted for Slew rate
long    Itarget2=0;               // Control loop 2 target adjusted for Slew rate
long    Itarget3=0;               // Control loop 3 target adjusted for Slew rate

int16    SlewStep1=_IQ15(0.1);            // 0.05A/ms, see Excel spreadsheet
int16    SlewStep2=_IQ15(0.1);            // 0.05A/ms, see Excel spreadsheet
int16    SlewStep3=_IQ15(0.1);            // 0.05A/ms, see Excel spreadsheet

long    SlewError=0;              // Difference between Vset and Vtarget
int16    SlewStepAll=_IQ15(0.1);  // 0.05A/ms, see Excel spreadsheet
int16    ResetSlew=0;             // Forces update of individual SlewSteps with SlewStepAll

