pkahlert/EPE-MES/02_Software/01_c2000/C2000_LaunchPad/f2802x_examples/LED_Boost_CapTouch/LED_Boost_CapTouch_Main.c
    // ADC Channel Selection
    ChSel[0] = 2;        // Dummy read for first sample bug
    ChSel[1] = 2;        // A2 - Iout1 - blue
    ChSel[2] = 1;        // A1 - Iout2 - green
    ChSel[3] = 6;        // A6 - Iout3 - red
    ChSel[9] = 9;        // B1 - Vout1
    ChSel[10] = 10;      // B2 - Vout2
    ChSel[11] = 12;      // B3 - Vout3
    ChSel[12] = 14;      // B6 - Vin / Vout8

    // ADC Trigger Selection
    TrigSel[0] = 5;        // ePWM1, ADCSOCA
    TrigSel[1] = 5;        // ePWM1, ADCSOCA
    TrigSel[2] = 5;        // ePWM1, ADCSOCA
    TrigSel[3] = 5;        // ePWM1, ADCSOCA
    TrigSel[9] = 5;        // ePWM1, ADCSOCA
    TrigSel[10] = 5;       // ePWM1, ADCSOCA
    TrigSel[11] = 5;       // ePWM1, ADCSOCA
    TrigSel[12] = 5;       // ePWM1, ADCSOCA

    ADC_SOC_CNF(ChSel, TrigSel, ACQPS, 16, 0);
    PWM_DualUpDwnCnt_CNF(1, prd, 1, 0);
    PWM_DualUpDwnCnt_CNF(2, prd, 0, 2);
    PWM_1ch_UpDwnCnt_CNF(3, prd, 0, 2);

    // Configure ePWMs to generate ADC SOC pulses
    EPwm1Regs.ETSEL.bit.SOCAEN = 1;                // Enable ePWM1 SOCA pulse
    EPwm1Regs.ETSEL.bit.SOCASEL = ET_CTR_PRD;      // SOCA from ePWM1 Zero event
    EPwm1Regs.ETPS.bit.SOCAPRD = ET_3RD;           // Trigger ePWM1 SOCA on every 3rd event

    DPL_Init();                                    // DPL ASM ISR init

//----------------------------------------------------------------------
#if (INCR_BUILD == 1)     // Open-Loop
//----------------------------------------------------------------------

// Lib Module connection to "nets" 
//----------------------------------------

    // Boost 1 connections
    ADCDRV_1ch_Rlt1 = &AdcNetBus[1];
    PWMDRV_DualUpDwnCnt_Duty1A = &Duty1;
    // Boost 2 connections
    ADCDRV_1ch_Rlt2 = &AdcNetBus[2];
    PWMDRV_DualUpDwnCnt_Duty1B = &Duty2;
    // Boost 3 connections
    ADCDRV_1ch_Rlt3 = &AdcNetBus[3];
    PWMDRV_1ch_UpDwnCnt_Duty2 = &Duty3;
    // Voltage connections
    ADCDRV_1ch_Rlt9 = &AdcNetBus[9];
    ADCDRV_1ch_Rlt10 = &AdcNetBus[10];
    ADCDRV_1ch_Rlt11 = &AdcNetBus[11];
    ADCDRV_1ch_Rlt12 = &AdcNetBus[12];
#endif // (INCR_BUILD == 1)


//----------------------------------------------------------------------
#if (INCR_BUILD == 2) // Closed-Loop Current
//----------------------------------------------------------------------

// Lib Module connection to "nets" 
//----------------------------------------

    // Boost 1 connections
    ADCDRV_1ch_Rlt1 = &AdcNetBus[1];
    CNTL_2P2Z_Ref1 = &IrefNetBus1;                // point to Iref1
    CNTL_2P2Z_Fdbk1 = &AdcNetBus[1];              // point to Iout1
    CNTL_2P2Z_Coef1 = &CNTL_2P2Z_CoefStruct1.b2;  // point to first coeff of 1st loop
    CNTL_2P2Z_Out1 = &UoutNetBus1;                // point to 2P2Z Uout1
    PWMDRV_DualUpDwnCnt_Duty1A = &UoutNetBus1;

    // Boost 2 connections
    ADCDRV_1ch_Rlt2 = &AdcNetBus[2];
    CNTL_2P2Z_Ref2 = &IrefNetBus2;                // point to Iref2
    CNTL_2P2Z_Fdbk2 = &AdcNetBus[2];              // point to Iout2
    CNTL_2P2Z_Coef2 = &CNTL_2P2Z_CoefStruct2.b2;  // point to first coeff of 1st loop
    CNTL_2P2Z_Out2 = &UoutNetBus2;                // point to 2P2Z Uout2
    PWMDRV_DualUpDwnCnt_Duty1B = &UoutNetBus2;

    // Boost 3 connections
    ADCDRV_1ch_Rlt3 = &AdcNetBus[3];
    CNTL_2P2Z_Ref3 = &IrefNetBus3;                // point to Iref3
    CNTL_2P2Z_Fdbk3 = &AdcNetBus[3];              // point to Iout3
    CNTL_2P2Z_Coef3 = &CNTL_2P2Z_CoefStruct3.b2;  // point to first coeff of 1st loop
    CNTL_2P2Z_Out3 = &UoutNetBus3;                // point to 2P2Z Uout3
    PWMDRV_1ch_UpDwnCnt_Duty2 = &UoutNetBus3;

    // Voltage connections
    ADCDRV_1ch_Rlt9 = &AdcNetBus[9];
    ADCDRV_1ch_Rlt10 = &AdcNetBus[10];
    ADCDRV_1ch_Rlt11 = &AdcNetBus[11];
    ADCDRV_1ch_Rlt12 = &AdcNetBus[12];

#endif // (INCR_BUILD == 2)


//----------------------------------------------------------------------
#if (INCR_BUILD == 3) //
//----------------------------------------------------------------------
#endif // (INCR_BUILD == 3)


//=================================================================================
//    INTERRUPT & ISR INITIALISATION (best to run this section after other initialisation)
//=================================================================================
    EALLOW;
    PieVectTable.EPWM1_INT = &DPL_ISR;          // Map Interrupt
    EDIS;
    PieCtrlRegs.PIEIER3.bit.INTx1 = 1;          // PIE level enable, Grp3 / Int1
    
    // Configure SCI Interrupt
    EALLOW;
    PieVectTable.SCIRXINTA = &SciISR;           // Map Interrupt
    EDIS;
    PieCtrlRegs.PIEIER9.bit.INTx1 = 1;          // PIE level enable, Grp9 / Int1

    // Configure ISR trigger
    EPwm1Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;    // INT on Period event
    EPwm1Regs.ETSEL.bit.INTEN = 1;              // Enable INT
    EPwm1Regs.ETPS.bit.INTPRD = ET_3RD;         // Generate ISR INT on every 3rd event

    // Enable Peripheral, global Ints and higher priority real-time debug events:
    IER |= M_INT3 | M_INT9;    // Enable CPU INT3 connected to EPWM1-6 INTs:
    EINT;                      // Enable Global interrupt INTM
    ERTM;                      // Enable Global realtime interrupt DBGM

//=================================================================================
//    BACKGROUND (BG) LOOP
//=================================================================================

//--------------------------------- FRAMEWORK -------------------------------------
    for(;;)
    {
        // State machine entry & exit point
        //===========================================================
        (*Alpha_State_Ptr)();    // jump to an Alpha state (A0,B0,...)
        //===========================================================

    }
} //END MAIN CODE


//=================================================================================
//    STATE-MACHINE SEQUENCING AND SYNCRONIZATION
//=================================================================================

//--------------------------------- FRAMEWORK -------------------------------------

void A0(void)
{
    // loop rate synchronizer for A-tasks
    if(CpuTimer0Regs.TCR.bit.TIF == 1)
    {
        CpuTimer0Regs.TCR.bit.TIF = 1;    // clear flag
        //-----------------------------------------------------------
        (*A_Task_Ptr)();         // jump to an A Task (A1,A2,A3,...)
        //-----------------------------------------------------------
        VTimer0[0]++;            // virtual timer 0, instance 0 (spare)
        SerialCommsTimer++;      // used by DSP280x_SciCommsGui.c
    }
    Alpha_State_Ptr = &B0;       // Comment out to allow only A tasks
}

void B0(void)
{
    // loop rate synchronizer for B-tasks
    if(CpuTimer1Regs.TCR.bit.TIF == 1)
    {
        CpuTimer1Regs.TCR.bit.TIF = 1;                // clear flag
        //-----------------------------------------------------------
        (*B_Task_Ptr)();        // jump to a B Task (B1,B2,B3,...)
        //-----------------------------------------------------------
        VTimer1[0]++;           // virtual timer 1, instance 0 (used to control SPI LEDs)
    }
    Alpha_State_Ptr = &C0;
}

void C0(void)
{
    // loop rate synchronizer for C-tasks
    if(CpuTimer2Regs.TCR.bit.TIF == 1)
    {
        CpuTimer2Regs.TCR.bit.TIF = 1;                // clear flag
        //-----------------------------------------------------------
        (*C_Task_Ptr)();        // jump to a C Task (C1,C2,C3,...)
        //-----------------------------------------------------------
        VTimer2[0]++;           // virtual timer 2, instance 0 (spare)
    }
    Alpha_State_Ptr = &A0;      // Back to State A0
}


