pkahlert/EPE-MES/02_Software/01_c2000/C2000_LaunchPad/f2802x_examples/LED_Boost_CapTouch/LED_Boost_CapTouch_Main.c
//=================================================================================
//    A - TASKS
//=================================================================================
//--------------------------------------------------------
void A1(void) // Over-current protection, On/Off Control 
//--------------------------------------------------------
{

    // Over-current protection
    if (Gui_Iout1 > OC_limit)
        OCtrip = 1;
    if (Gui_Iout2 > OC_limit)
        OCtrip = 1;
    if (Gui_Iout3 > OC_limit)
        OCtrip = 1;
    
    if (OCtrip)
        StopAll = 1;

    // All Channel shut-down control (no sequencing)
    if(StopAll == 1)
    {
        IrefNetBus1 = 0;
        IrefNetBus2 = 0;
        IrefNetBus3 = 0;
        ChannelEnable1 = 0;
        ChannelEnable2 = 0;
        ChannelEnable3 = 0;
        Gui_Iset1 = 0;
        Gui_Iset2 = 0;
        Gui_Iset3 = 0;
        MergeLEDs = 0;
        AutoColor = 0;
        SetColor1 = 0;
        SetColor2 = 0;
        StopAll = 0;
    }
    
    if (EnableAll == 1)
    {
        ChannelEnable1 = 1;
        ChannelEnable2 = 1;
        ChannelEnable3 = 1;
        EnableAll = 0;
    }

    // Channel 1 On/Off control
    if(ChannelEnable1 == 1)
        Itarget1 = Iset1;
    else
        Itarget1 = 0;
    // Channel 2 On/Off control
    if(ChannelEnable2 == 1)
        Itarget2 = Iset2;
    else
        Itarget2 = 0;
    // Channel 3 On/Off control
    if(ChannelEnable3 == 1)
        Itarget3 = Iset3;
    else
        Itarget3 = 0;

    //-------------------
    A_Task_Ptr = &A2;
    //-------------------
}

//-----------------------------------------------------------------
void A2(void) // SCI GUI, Slew control, LED current control
//-----------------------------------------------------------------
{
    SerialHostComms();    //found in SciCommsGui.c

    // This code ensures that each channel's current ramps at a given slew rate at a rate defined by SlewStep.
    // Derivation shown in attached Excel Spreadsheet
    SlewError = (IrefNetBus1 - Itarget1);
    if (SlewError > SlewStep1)
        IrefNetBus1 = IrefNetBus1 - SlewStep1;
    else if (SlewError < (-SlewStep1) )
        IrefNetBus1 = IrefNetBus1 + SlewStep1;
    else
        IrefNetBus1 = Itarget1;

    SlewError = (IrefNetBus2 - Itarget2);
    if (SlewError > SlewStep2)
        IrefNetBus2 = IrefNetBus2 - SlewStep2;
    else if (SlewError < (-SlewStep2) )
        IrefNetBus2 = IrefNetBus2 + SlewStep2;
    else
        IrefNetBus2 = Itarget2;

    SlewError = (IrefNetBus3 - Itarget3);
    if (SlewError > SlewStep3)
        IrefNetBus3 = IrefNetBus3 - SlewStep3;
    else if (SlewError < (-SlewStep3) )
        IrefNetBus3 = IrefNetBus3 + SlewStep3;
    else
        IrefNetBus3 = Itarget3;

    // Current setting calculated by:
    // Iset = Gui_Iset * iK_Iout, where iK_Iout = 1/K_Iout (i.e. inverse K_Iout)
    // view and set following variables in Watch Window as:
    //        Gui_Iset = Q15

    //Multiply with longs to get proper result then shift by 14 to turn it back into an int16
    Iset1 = ((long)Gui_Iset1*(long)iK_Iset) >> 5;
    Iset2 = ((long)Gui_Iset2*(long)iK_Iset) >> 5;
    Iset3 = ((long)Gui_Iset3*(long)iK_Iset) >> 5;

    //-------------------
    A_Task_Ptr = &A1;
    //-------------------
}

//-----------------------------------------------------------------
void comp(void) // Hardware fix for poor feedback path on LED Boosterpack
//-----------------------------------------------------------------
{

    if((Gui_Iset1 == 0) && (AdcNetBus[1] == 0) && (UoutNetBus1 >= _IQ24(0.001))){
        AdcNetBus[1] = 40960;
    }
    if((Gui_Iset2 == 0) && (AdcNetBus[2] == 0) && (UoutNetBus2 >= _IQ24(0.001))){
        AdcNetBus[2] = 40960;
    }
    if((Gui_Iset3 == 0) && (AdcNetBus[3] == 0) && (UoutNetBus3 >= _IQ24(0.001))){
        AdcNetBus[3] = 40960;
    }

}

//=================================================================================
//    B - TASKS
//=================================================================================

//----------------------------------- USER ----------------------------------------
//----------------------------------------------------
void B1(void) // Current Dashboard measurements
//----------------------------------------------------
{
// Measurement code expandable to multiple channels, defined by "NumChannels"
// Voltage measurement calculated by:
//    Gui_Vout = VoutAvg * K_Vout, where VoutAvg = sum of 8 VoutR samples
//
    HistPtr++;
    if (HistPtr >= HistorySize)    HistPtr = 0;

    // BoxCar Averages - Input Raw samples into BoxCar arrays
    //----------------------------------------------------------------
    Hist_Iout1[HistPtr] = Iout1R;
    Hist_Iout2[HistPtr] = Iout2R;
    Hist_Iout3[HistPtr] = Iout3R;
    Hist_Vout1[HistPtr] = Vout1R;
    Hist_Vout2[HistPtr] = Vout2R;
    Hist_Vout3[HistPtr] = Vout3R;
    Hist_Vin[HistPtr] = VinR;

    // Current Measurement
    //----------------------------------------------------------------
    // view following variables in Watch Window as:
    //        Gui_Vout = Q10

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Iout1[i];    //Q12 * 8 = Q15
    Gui_Iout1 = ((long)temp_Scratch*(long)K_Iout) >> 15;    //Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Iout2[i];    //Q12 * 8 = Q15
    Gui_Iout2 = ((long)temp_Scratch*(long)K_Iout) >> 15;    //Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Iout3[i];    //Q12 * 8 = Q15
    Gui_Iout3 = ((long)temp_Scratch*(long)K_Iout) >> 15;    //Q15*Q15 >> 15 = Q15

    //-----------------
    B_Task_Ptr = &B2;    
    //-----------------
}

//----------------------------------------------------
void B2(void) // Voltage Dashboard measurements
//----------------------------------------------------
{
// Measurement code expandable to multiple channels, defined by "NumChannels"
// Voltage measurement calculated by:
//    Gui_Vout = VoutAvg * K_Vout, where VoutAvg = sum of 8 VoutR samples

    HistPtr++;
    if (HistPtr >= HistorySize)    HistPtr = 0;

    // BoxCar Averages - Input Raw samples into BoxCar arrays
    //----------------------------------------------------------------
    Hist_Iout1[HistPtr] = Iout1R;
    Hist_Iout2[HistPtr] = Iout2R;
    Hist_Iout3[HistPtr] = Iout3R;
    Hist_Vout1[HistPtr] = Vout1R;
    Hist_Vout2[HistPtr] = Vout2R;
    Hist_Vout3[HistPtr] = Vout3R;
    Hist_Vin[HistPtr] = VinR;

    // Voltage Measurement
    //----------------------------------------------------------------
    // view following variables in Watch Window as:
    //        Gui_Vout = Q10
    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Vout1[i];    //Q12 * 8 = Q15
    Gui_Vout1 = ((long)temp_Scratch*(long)K_Vout) >> 15;    //Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Vout2[i];    //Q12 * 8 = Q15
    Gui_Vout2 = ((long)temp_Scratch*(long)K_Vout) >> 15;    //Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Vout3[i];    //Q12 * 8 = Q15
    Gui_Vout3 = ((long)temp_Scratch*(long)K_Vout) >> 15;    //Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Vin[i];    //Q12 * 8 = Q15
    Gui_Vin = ((long)temp_Scratch*(long)K_Vin) >> 15;    //Q15*Q15 >> 15 = Q15

    //-----------------
    B_Task_Ptr = &B1;    
    //-----------------
}
//=================================================================================
//    C - TASKS
//=================================================================================

//----------------------------- USER ----------------------------------------------

