pkahlert/EPE-MES/02_Software/01_c2000/C2000_LaunchPad/f2802x_examples/LED_Boost_CapTouch/LED_Boost_CapTouch_Main.c
//----------------------------------------
void C1(void) //  Blinking LED control
//----------------------------------------
{

    //-----------------
    C_Task_Ptr = &C2;    
    //-----------------
}

//----------------------------------------
void C2(void) //  Automatic color control, Manual color control
//----------------------------------------
{
    #define AutoColorMIN 253670
    
    if (AutoColor)
    {

        //Calculate new RGB values
        HSVtoRGB(&gHSV, &gRGB);
        //Scale color values into currents
        Gui_Iset1 = _IQ15mpy(gRGB.qBlue, _IQ15(0.005));
        Gui_Iset2 = _IQ15mpy(gRGB.qGreen, _IQ15(0.01));
        Gui_Iset3 = _IQ15mpy(gRGB.qRed, _IQ15(0.01));

    }
    else
    {
        if (ResetSlew == 1)
        {
            SlewStep1 = SlewStepAll;
            SlewStep2 = SlewStepAll;
            SlewStep3 = SlewStepAll;
            ResetSlew = 0;
        }    
    }

    if (!AutoColor)
    {    
        switch(SetColor1)
        {
            case 0:
                break;
            case 99:    // Off
                Gui_Iset1 = 0;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0;
                break;
            case 1:        // Red
                Gui_Iset1 = 0;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0.03*32768;
                break;
            case 2:        // Orange
                Gui_Iset1 = 0;
                Gui_Iset2 = 0.01*32768;
                Gui_Iset3 = 0.035*32768;
                break;
            case 3:        // Yellow
                Gui_Iset1 = 0;;
                Gui_Iset2 = 0.025*32768;
                Gui_Iset3 = 0.035*32768;
                break;
            case 4:        // Green
                Gui_Iset1 = 0;
                Gui_Iset2 = 0.03*32768;
                Gui_Iset3 = 0;
                break;
            case 5:        // Blue
                Gui_Iset1 = 0.03*32768;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0;
                break;
            case 6:        // Purple
                Gui_Iset1 = 0.025*32768;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0.025*32768;
                break;
            case 7:        // White
                Gui_Iset1 = 0.015*32768;
                Gui_Iset2 = 0.02*32768;
                Gui_Iset3 = 0.025*32768;
                break;
            default:
                break;
        } // SetColor1
        SetColor1 = 0;

    } // !AutoColor

    //-----------------
    C_Task_Ptr = &C1;    
    //-----------------
}

void HSVtoRGB(tHSV *myHSV, tRGB *myRGB)
{
    _iq15 qMin;
    _iq15 qChroma;
    _iq15 qHPrime;
    long lHPrimeInt;
    _iq15 qHPrimeFrac;
    _iq15 qX;

    qChroma = _IQ15mpy(myHSV->qSaturation, myHSV->qValue);
    qHPrime = _IQ15div(myHSV->qHue, _IQ15(60));
    lHPrimeInt = _IQ15int(qHPrime);    
    qHPrimeFrac = _IQ15frac(qHPrime);

    qX = _IQ15mpy(qChroma, _IQ15(1) - _IQ15abs(_IQ15(lHPrimeInt % 2) + qHPrimeFrac - _IQ15(1)));

    if(lHPrimeInt < 1)
    {
        myRGB->qRed = qChroma;
        myRGB->qGreen = qX;
        myRGB->qBlue = 0;
    }
    else if(lHPrimeInt < 2)
    {
        myRGB->qRed = qX;
        myRGB->qGreen = qChroma;
        myRGB->qBlue = 0;
    }
    else if(lHPrimeInt < 3)
    {
        myRGB->qRed = 0;
        myRGB->qGreen = qChroma;
        myRGB->qBlue = qX;
    }
    else if(lHPrimeInt < 4)
    {
        myRGB->qRed = 0;
        myRGB->qGreen = qX;
        myRGB->qBlue = qChroma;
    }
    else if(lHPrimeInt < 5)
    {
        myRGB->qRed = qX;
        myRGB->qGreen = 0;
        myRGB->qBlue = qChroma;
    }
    else if(lHPrimeInt < 6)
    {
        myRGB->qRed = qChroma;
        myRGB->qGreen = 0;
        myRGB->qBlue = qX;
    }    
    
    qMin = myHSV->qValue - qChroma;
    myRGB->qRed += qMin;
    myRGB->qGreen += qMin;
    myRGB->qBlue += qMin;

}
